OpenFOAM/freeSurfaceFlows/freeSurfaceFlows-0Fv2012/cases/spillway-2.2/0.org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.1470;

boundaryField
{
    inletAir
    {
        type            fixedValue;
        value           uniform 0.1470;
    }
    
    inletWater
    {
        type            fixedValue;
        value           uniform 0.1470;
    }

    outlet
    {
        type            zeroGradient;
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0.1470;
        value           uniform 0.1470;
    }

    bottomWall
    {
        type            omegaWallFunction;
        value           uniform 0.1470;
    }
    
    dam_Mesh
    {
        type            omegaWallFunction;
        value           uniform 0.1470;
    }
    
    front
    {
        type            empty;
    }
    
    back
    {
        type            empty;
    }
    
    defaultFaces
    {
        type            empty;
    }
}



// ************************************************************************* //
